# Pandas library

In [70]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [7]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df.head(3)

                   A         B         C         D
2013-01-01  1.431582 -1.655434 -0.980987 -0.160012
2013-01-02 -1.306048  0.478527  0.200747  1.827575
2013-01-03  0.309281  1.006739  1.318236  0.267811

In [8]:
df.tail(2)

                   A         B         C         D
2013-01-05 -0.227579  0.748235 -0.548430  1.001576
2013-01-06  0.080344 -0.087919  0.212388 -1.371906

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.values

array([[ 1.43158234, -1.65543429, -0.98098721, -0.16001179],
       [-1.30604768,  0.47852689,  0.20074657,  1.82757526],
       [ 0.30928131,  1.00673924,  1.31823555,  0.26781068],
       [ 0.67526204,  0.10570036, -1.35126155,  1.69873225],
       [-0.22757935,  0.74823512, -0.54842991,  1.00157584],
       [ 0.08034385, -0.08791896,  0.21238785, -1.37190637]])

In [13]:
 df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.160474  0.099308 -0.191551  0.543963
std    0.917666  0.948953  0.968713  1.219259
min   -1.306048 -1.655434 -1.351262 -1.371906
25%   -0.150599 -0.039514 -0.872848 -0.053056
50%    0.194813  0.292114 -0.173842  0.634693
75%    0.583767  0.680808  0.209478  1.524443
max    1.431582  1.006739  1.318236  1.827575

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.431582   -1.306048    0.309281    0.675262   -0.227579    0.080344
B   -1.655434    0.478527    1.006739    0.105700    0.748235   -0.087919
C   -0.980987    0.200747    1.318236   -1.351262   -0.548430    0.212388
D   -0.160012    1.827575    0.267811    1.698732    1.001576   -1.371906

In [15]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.160012 -0.980987 -1.655434  1.431582
2013-01-02  1.827575  0.200747  0.478527 -1.306048
2013-01-03  0.267811  1.318236  1.006739  0.309281
2013-01-04  1.698732 -1.351262  0.105700  0.675262
2013-01-05  1.001576 -0.548430  0.748235 -0.227579
2013-01-06 -1.371906  0.212388 -0.087919  0.080344

In [19]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06  0.080344 -0.087919  0.212388 -1.371906
2013-01-05 -0.227579  0.748235 -0.548430  1.001576
2013-01-04  0.675262  0.105700 -1.351262  1.698732
2013-01-03  0.309281  1.006739  1.318236  0.267811
2013-01-02 -1.306048  0.478527  0.200747  1.827575
2013-01-01  1.431582 -1.655434 -0.980987 -0.160012

In [20]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  1.431582 -1.655434 -0.980987 -0.160012
2013-01-06  0.080344 -0.087919  0.212388 -1.371906
2013-01-04  0.675262  0.105700 -1.351262  1.698732
2013-01-02 -1.306048  0.478527  0.200747  1.827575
2013-01-05 -0.227579  0.748235 -0.548430  1.001576
2013-01-03  0.309281  1.006739  1.318236  0.267811

In [21]:
df['A']

2013-01-01    1.431582
2013-01-02   -1.306048
2013-01-03    0.309281
2013-01-04    0.675262
2013-01-05   -0.227579
2013-01-06    0.080344
Freq: D, Name: A, dtype: float64

In [22]:
df.A

2013-01-01    1.431582
2013-01-02   -1.306048
2013-01-03    0.309281
2013-01-04    0.675262
2013-01-05   -0.227579
2013-01-06    0.080344
Freq: D, Name: A, dtype: float64

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01  1.431582 -1.655434 -0.980987 -0.160012
2013-01-02 -1.306048  0.478527  0.200747  1.827575
2013-01-03  0.309281  1.006739  1.318236  0.267811

In [24]:
df.loc[dates[0]]

A    1.431582
B   -1.655434
C   -0.980987
D   -0.160012
Name: 2013-01-01 00:00:00, dtype: float64

In [25]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  1.431582 -1.655434
2013-01-02 -1.306048  0.478527
2013-01-03  0.309281  1.006739
2013-01-04  0.675262  0.105700
2013-01-05 -0.227579  0.748235
2013-01-06  0.080344 -0.087919

In [26]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -1.306048  0.478527
2013-01-03  0.309281  1.006739
2013-01-04  0.675262  0.105700

In [27]:
df.loc[dates[0],'A']

1.4315823420824039

In [28]:
 df.at[dates[0],'A'] #faster access than loc
 df.iloc[3]

1.4315823420824039

In [29]:
df.iloc[3]

A    0.675262
B    0.105700
C   -1.351262
D    1.698732
Name: 2013-01-04 00:00:00, dtype: float64

In [30]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.675262  0.105700
2013-01-05 -0.227579  0.748235

In [33]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.306048  0.200747
2013-01-03  0.309281  1.318236
2013-01-05 -0.227579 -0.548430

In [39]:
df.iloc[[1,2,4], 0]

2013-01-02   -1.306048
2013-01-03    0.309281
2013-01-05   -0.227579
Name: A, dtype: float64

In [40]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -1.306048  0.478527  0.200747  1.827575
2013-01-03  0.309281  1.006739  1.318236  0.267811

In [41]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -1.655434 -0.980987
2013-01-02  0.478527  0.200747
2013-01-03  1.006739  1.318236
2013-01-04  0.105700 -1.351262
2013-01-05  0.748235 -0.548430
2013-01-06 -0.087919  0.212388

In [42]:
df.iloc[0,0]

1.4315823420824039

In [43]:
df.iat[0,0] #faster than iloc

1.4315823420824039

In [44]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.431582 -1.655434 -0.980987 -0.160012
2013-01-03  0.309281  1.006739  1.318236  0.267811
2013-01-04  0.675262  0.105700 -1.351262  1.698732
2013-01-06  0.080344 -0.087919  0.212388 -1.371906

In [45]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.431582       NaN       NaN       NaN
2013-01-02       NaN  0.478527  0.200747  1.827575
2013-01-03  0.309281  1.006739  1.318236  0.267811
2013-01-04  0.675262  0.105700       NaN  1.698732
2013-01-05       NaN  0.748235       NaN  1.001576
2013-01-06  0.080344       NaN  0.212388       NaN

In [46]:
df2 = df.copy()

In [47]:
df2['E'] = ['one', 'one','two','three','four','three']

In [48]:
df2

                   A         B         C         D      E
2013-01-01  1.431582 -1.655434 -0.980987 -0.160012    one
2013-01-02 -1.306048  0.478527  0.200747  1.827575    one
2013-01-03  0.309281  1.006739  1.318236  0.267811    two
2013-01-04  0.675262  0.105700 -1.351262  1.698732  three
2013-01-05 -0.227579  0.748235 -0.548430  1.001576   four
2013-01-06  0.080344 -0.087919  0.212388 -1.371906  three

In [49]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.309281  1.006739  1.318236  0.267811   two
2013-01-05 -0.227579  0.748235 -0.548430  1.001576  four

## Setting

In [51]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [52]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [53]:
df['F'] = s1

In [54]:
df

                   A         B         C         D    F
2013-01-01  1.431582 -1.655434 -0.980987 -0.160012  NaN
2013-01-02 -1.306048  0.478527  0.200747  1.827575  1.0
2013-01-03  0.309281  1.006739  1.318236  0.267811  2.0
2013-01-04  0.675262  0.105700 -1.351262  1.698732  3.0
2013-01-05 -0.227579  0.748235 -0.548430  1.001576  4.0
2013-01-06  0.080344 -0.087919  0.212388 -1.371906  5.0

In [55]:
df.at[dates[0],'A'] = 0

In [56]:
df.iat[0,1] = 0

In [57]:
df.loc[:,'D'] = np.array([5] * len(df))

In [58]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.980987  5  NaN
2013-01-02 -1.306048  0.478527  0.200747  5  1.0
2013-01-03  0.309281  1.006739  1.318236  5  2.0
2013-01-04  0.675262  0.105700 -1.351262  5  3.0
2013-01-05 -0.227579  0.748235 -0.548430  5  4.0
2013-01-06  0.080344 -0.087919  0.212388  5  5.0

In [59]:
df2 = df.copy()

In [60]:
 df2[df2 > 0] = -df2

In [61]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.980987 -5  NaN
2013-01-02 -1.306048 -0.478527 -0.200747 -5 -1.0
2013-01-03 -0.309281 -1.006739 -1.318236 -5 -2.0
2013-01-04 -0.675262 -0.105700 -1.351262 -5 -3.0
2013-01-05 -0.227579 -0.748235 -0.548430 -5 -4.0
2013-01-06 -0.080344 -0.087919 -0.212388 -5 -5.0

 ## Missing data

In [62]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [64]:
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.980987  5  NaN  1.0
2013-01-02 -1.306048  0.478527  0.200747  5  1.0  1.0
2013-01-03  0.309281  1.006739  1.318236  5  2.0  NaN
2013-01-04  0.675262  0.105700 -1.351262  5  3.0  NaN

In [65]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -1.306048  0.478527  0.200747  5  1.0  1.0

In [66]:
 df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.980987  5  5.0  1.0
2013-01-02 -1.306048  0.478527  0.200747  5  1.0  1.0
2013-01-03  0.309281  1.006739  1.318236  5  2.0  5.0
2013-01-04  0.675262  0.105700 -1.351262  5  3.0  5.0

In [74]:
df1.isna()

AttributeError: 'DataFrame' object has no attribute 'isna'

## Operations

In [76]:
df.mean()
df.mean(0)

A   -0.078123
B    0.375214
C   -0.191551
D    5.000000
F    3.000000
dtype: float64

In [78]:
df.mean(1)

2013-01-01    1.004753
2013-01-02    1.074645
2013-01-03    1.926851
2013-01-04    1.485940
2013-01-05    1.794445
2013-01-06    2.040963
Freq: D, dtype: float64

In [81]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [80]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.690719  0.006739  0.318236  4.0  1.0
2013-01-04 -2.324738 -2.894300 -4.351262  2.0  0.0
2013-01-05 -5.227579 -4.251765 -5.548430  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [82]:
115/4

28.75

In [83]:
115/10

11.5